//指针操作  赋值、解引用、取地址、指针与整数相加、递增指针、
//          指针减去一个整数、递减指针、指针求差、比较 

#include<stdio.h>

int main(void)
{
	int data[5] = {10,20,30,40,50};
	int *p1, *p2, *p3;
	
	p1 = data;
	p2 = &data[2];
	
	//打印 值的地址、指针指向的值、指针的地址
	printf("p1 = %p, *p1 = %d, &p1 = %p.\n\n", p1, *p1, &p1);
	
	//指针加法
	printf("p1 + 4 = %p , *(p1 + 4 ) = %d.\n\n", p1 + 4 , *(p1 + 4));
	
	//指针递增 
	p1++;  
	printf("p1 = %p, *p1 = %d, &p1 = %p.\n\n", p1, *p1, &p1); 
	//p1的地址不变，p1指针指向的值和值的地址都改变了。
	
	//一个指针减去一个整数
	
	p3 = p1 + 3;
	printf("*p3 = %d, p3 = %p, p3-2 = %p.\n\n", *p3, p3, p3-2);
	
	return 0; 
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
 } 
